{
	"schema_version": "2.0",

	// All repositories must be an HTTP or HTTPS URL. HTTPS is vastly superior
	// since verification of the source server is performed on SSL certificates.
	"repositories": [
		"http://sublime.wbond.net/packages.json",
		"https://github.com/buymeasoda/soda-theme",
		"https://github.com/SublimeText"
	],

	// The "packages_cache" is completely optional, but allows the
	// channel to cache and deliver package data from multiple
	// repositories in a single HTTP request, allowing for significantly
	// improved performance.
	"packages_cache": {

		// The first level keys are the repository URLs
		"http://sublime.wbond.net/packages.json": [

			// Each repository has an array of packages with their fully
			// expanded info. This means that the "details" key must be expanded
			// into the various keys it provides.
			{
				"name": "Alignment",
				"description": "Multi-line and multiple selection alignment plugin",
				"author": "wbond",
				"homepage": "http://wbond.net/sublime_packages/alignment",
				"releases": [
					{
						"version": "2.0.0",
						"url": "https://sublime.wbond.net/Alignment.sublime-package",
						"date": "2011-09-18 20:12:41"
					}
				]
			}
		]
	},

	// Package Control ships with the SSL Certificate Authority (CA) cert for the
	// SSL certificate that secures and identifies sublime.wbond.net. After this
	// initial connection is made, the channel server provides a list of CA certs
	// for the various URLs that Package Control need to connect to. This way the
	// default channel (https://sublime.wbond.net/channel.json) can provide
	// real-time updates to CA certs in the case that a CA is compromised. The
	// CA certs are extracted from openssl, and the server runs on an LTS version
	// of Ubuntu, which automatically applies security patches from the official
	// Ubuntu repositories. This architecture helps to ensure that the packages
	// being downloaded are from the source listed and that users are very
	// unlikely to be the subject of the man-in-the-middle attack.
	"certs": {

		// All certs have the domain they apply to as the key
		"sublime.wbond.net": [
			// The value is an array of two elements, the first being an md5
			// hash of the contents of the certificate. This helps in detecting
			// CA cert changes. The second element is the URL where the cert
			// can be downloaded, if it is not already installed on the user’s
			// copy of Sublime Text.
			"7f4f8622b4fd001c7f648e09aae7edaa",
			"https://sublime.wbond.net/certs/7f4f8622b4fd001c7f648e09aae7edaa"
		]
	}
}